{"title": "Data structure","extract": "In computer science, a data structure is a particular way of organizing data in a computer so that it can be used efficiently. Data structures can implement one or more particular abstract data types (ADT), which specify the operations that can be performed on a data structure and the computational complexity of those operations. In comparison, a data structure is a concrete implementation of the specification provided by an ADT.\nDifferent kinds of data structures are suited to different kinds of applications, and some are highly specialized to specific tasks. For example, relational databases commonly use B-tree indexes for data retrieval, while compiler implementations usually use hash tables to look up identifiers.\nData structures provide a means to manage large amounts of data efficiently for uses such as large databases and internet indexing services. Usually, efficient data structures are key to designing efficient algorithms. Some formal design methods and programming languages emphasize data structures, rather than algorithms, as the key organizing factor in software design. Data structures can be used to organize the storage and retrieval of information stored in both main memory and secondary memory."}
{"title": "Cristiano Ronaldo","extract": "Cristiano Ronaldo dos Santos Aveiro, ComM, GOIH (Portuguese pronunciation: [kɾiʃ'tjɐnu ʁuˈnaɫdu], born 5 February 1985) is a Portuguese professional footballer who plays for Spanish club Real Madrid and the Portugal national team. He is a forward and serves as captain for Portugal. In 2008, he won his first Ballon d'Or and FIFA World Player of the Year awards. Ronaldo then won the FIFA Ballon d'Or in 2013 and 2014. In 2016, he received his fourth Ballon d'Or, the most for a European player in the history of the award, and the inaugural Best FIFA Men's Player. In 2015, Ronaldo scored his 500th senior career goal for club and country.\nOften ranked the best player in the world and widely regarded as one of the greatest of all time, Ronaldo was named the best Portuguese player of all time by the Portuguese Football Federation, during its 100th anniversary celebrations in 2015. He is the only player to win four European Golden Shoe awards. One of the most marketable athletes in sport, in 2016 Forbes named Ronaldo the world's best paid athlete. In June 2016, ESPN ranked him the world's most famous athlete.\nRonaldo began his club career playing for Sporting CP, before signing with Manchester United at age 18 in 2003. After winning his first trophy, the FA Cup, during his first season in England, he helped United win three successive Premier League titles, a UEFA Champions League title, and a FIFA Club World Cup. By age 23, he had received Ballon d'Or and FIFA World Player of the Year nominations. He was the subject of the most expensive association football transfer when he moved from Manchester United to Real Madrid in 2009 in a transfer worth €94 million ($132 million). In Spain, he has since won one La Liga title, two Copas del Rey, two Champions League titles, and two Club World Cups. Ronaldo holds the record for most goals scored in a single UEFA Champions League season, having scored 17 goals in the 2013–14 season. In 2014, Ronaldo became the fastest player to score 200 goals in La Liga, which he accomplished in his 178th La Liga game. He is the only player in the history of football to score more than 50 goals in a season on six consecutive occasions. In 2015, Ronaldo became the all-time top goalscorer in the UEFA Champions League, and he also became Real Madrid's all-time leading goalscorer. He is the second highest goalscorer in La Liga history behind Lionel Messi, his perceived career rival.\nRonaldo made his international debut for Portugal in August 2003, at the age of 18. He is Portugal's most capped player of all time with over 130 caps, and has participated in seven major tournaments: four UEFA European Championships (2004, 2008, 2012 and 2016) and three FIFA World Cups (2006, 2010 and 2014). He is the first Portuguese player to reach 50 international goals, making him Portugal's all-time top goalscorer. He scored his first international goal in Euro 2004 and helped Portugal reach the final. He took over captaincy in July 2008, and he led Portugal to the semi-finals at Euro 2012, finishing the competition as joint-top scorer. In November 2014, Ronaldo became the all-time top scorer in the UEFA European Championship (including qualifying) with 23 goals. At Euro 2016, he became the most capped player of all-time in the tournament, the first player to score at four consecutive European Championship finals, and also equalled Michel Platini's all-time record for most goals scored in the competition. Ronaldo lifted the trophy after Portugal defeated France in the final, and he received the Silver Boot as the second-highest goalscorer of the tournament."}
{"title": "MapReduce","extract": "MapReduce is a programming model and an associated implementation for processing and generating large data sets with a parallel, distributed algorithm on a cluster.\nA MapReduce program is composed of a Map() procedure (method) that performs filtering and sorting (such as sorting students by first name into queues, one queue for each name) and a Reduce() method that performs a summary operation (such as counting the number of students in each queue, yielding name frequencies). The \"MapReduce System\" (also called \"infrastructure\" or \"framework\") orchestrates the processing by marshalling the distributed servers, running the various tasks in parallel, managing all communications and data transfers between the various parts of the system, and providing for redundancy and fault tolerance.\nThe model is inspired by the map and reduce functions commonly used in functional programming, although their purpose in the MapReduce framework is not the same as in their original forms. The key contributions of the MapReduce framework are not the actual map and reduce functions (which, for example, resemble the 1995 Message Passing Interface standard's reduce and scatter operations), but the scalability and fault-tolerance achieved for a variety of applications by optimizing the execution engine. As such, a single-threaded implementation of MapReduce will usually not be faster than a traditional (non-MapReduce) implementation; any gains are usually only seen with multi-threaded implementations. The use of this model is beneficial only when the optimized distributed shuffle operation (which reduces network communication cost) and fault tolerance features of the MapReduce framework come into play. Optimizing the communication cost is essential to a good MapReduce algorithm.\nMapReduce libraries have been written in many programming languages, with different levels of optimization. A popular open-source implementation that has support for distributed shuffles is part of Apache Hadoop. The name MapReduce originally referred to the proprietary Google technology, but has since been genericized. By 2014, Google was no longer using MapReduce as their primary Big Data processing model, and development on Apache Mahout had moved on to more capable and less disk-oriented mechanisms that incorporated full map and reduce capabilities."}
{"title": "Lionel Messi","extract": "Lionel Andrés \"Leo\" Messi (Spanish pronunciation: [ljoˈnel anˈdɾes ˈmesi]; born 24 June 1987) is an Argentine professional footballer who plays as a forward for Spanish club FC Barcelona and captains the Argentina national team. Often considered the best player in the world and rated by many in the sport as the greatest of all time, Messi is the only football player in history to win five FIFA Ballons d'Or, four of which he won consecutively, and the first player to win three European Golden Shoes. With Barcelona he has won eight La Liga titles and four UEFA Champions League titles, as well as four Copas del Rey. Both a prolific goalscorer and a creative playmaker, Messi holds the records for most goals scored in La Liga, a La Liga season (50), and a football season (82), as well as those for most assists made in La Liga and the Copa América. He has scored over 500 senior career goals for club and country.\nBorn and raised in central Argentina, Messi was diagnosed with a growth hormone deficiency as a child. At age 13, he relocated to Spain to join Barcelona, who agreed to pay for his medical treatment. After a fast progression through Barcelona's youth academy, Messi made his competitive debut aged 17 in October 2004. Despite being injury-prone during his early career, he established himself as an integral player for the club within the next three years, finishing 2007 as a finalist for both the Ballon d'Or and FIFA World Player of the Year award, a feat he repeated the following year. His first uninterrupted campaign came in the 2008–09 season, during which he helped Barcelona achieve the first treble in Spanish football. At 22 years old, Messi won the Ballon d'Or and FIFA World Player of the Year award by record voting margins.\nThree successful seasons followed, with Messi winning three consecutive FIFA Ballons d'Or, including an unprecedented fourth. His personal best campaign to date was the 2011–12 season, in which he set the La Liga and European records for most goals scored in a single season, while establishing himself as Barcelona's all-time top scorer in official competitions in March 2012. He again struggled with injury during the following two seasons, twice finishing second for the Ballon d'Or behind Cristiano Ronaldo, his perceived career rival. Messi regained his best form during the 2014–15 campaign, breaking the all-time goalscoring records in both La Liga and the Champions League in November 2014, and led Barcelona to a historic second treble.\nAn Argentine international, Messi is his country's all-time leading goalscorer. At youth level, he won the 2005 FIFA World Youth Championship, finishing the tournament with both the Golden Ball and Golden Shoe, and an Olympic gold medal at the 2008 Summer Olympics. His style of play as a diminutive, left-footed dribbler drew comparisons with compatriot Diego Maradona, who declared the teenager his successor. After making his senior debut in August 2005, Messi became the youngest Argentine to play and score in a FIFA World Cup during the 2006 edition, and reached the final of the 2007 Copa América, where he was named young player of the tournament. As the squad's captain from August 2011, he led Argentina to three consecutive finals of the 2014 World Cup, for which he won the Golden Ball, and the 2015 and 2016 Copas América. He was then convicted of tax fraud committed from 2007 to 2009, for which he received a fine and a suspended prison sentence."}
{"title": "Call of Duty","extract": "Call of Duty is a first-person shooter video game franchise. The series began on Microsoft Windows, and later expanded to consoles and handhelds. Several spin-off games have been released. The earlier games in the series are set primarily in World War II, including Call of Duty, Call of Duty 2, and Call of Duty 3. Beginning with Call of Duty 4: Modern Warfare, which is set in modern times, the series has shifted focus away from World War II. Modern Warfare, released November 2007, was followed by World at War and Modern Warfare 2. Black Ops, released November 2010, takes place in the Cold War, while Modern Warfare 3, released November 2011, takes place in a near-future setting. Black Ops II, released November 2012, takes place mainly in the year 2025. Call of Duty: Ghosts was released in November 2013. In May 2014, Advanced Warfare was announced. In November 6, 2015, Black Ops 3 was released. The most recent game, Infinite Warfare was released on November 4, 2016.\nThe Call of Duty games are published and owned by Activision. While Infinity Ward is still a developer, Treyarch and Sledgehammer Games also develop several of the titles with the release of the studios' games alternating with each other. Some games have been developed by Gray Matter Interactive, Nokia, Exakt Entertainment, Spark Unlimited, Amaze Entertainment, n-Space, Aspyr, Rebellion Developments, Ideaworks Game Studio, and nStigate Games. The games use a variety of engines, including the id Tech 3, the Treyarch NGL, and the IW engine.\nAs of April 2015, the Call of Duty series has sold over 175 million copies. Sales of all Call of Duty games topped US$15 billion.\nOther products in the franchise include a line of action figures designed by Plan-B Toys, a card game created by Upper Deck Company, Mega bloks sets by Mega Brands, and a comic book mini-series published by WildStorm Productions."}
{"title": "Antoine Griezmann","extract": "Antoine Griezmann (French pronunciation: ​[ɑ̃twan ɡʁijɛzman]; born 21 March 1991) is a French professional footballer who plays for Spanish club Atlético Madrid and the France national team as a forward.\nHe began his career at Real Sociedad, making his debut in 2009 and winning Segunda División in his first season. Across five seasons there, he scored 52 goals in 201 official matches. In 2014, he transferred to Atlético Madrid for €30 million. Griezmann has scored over 90 La Liga goals in his career.\nGriezmann was a French youth international, who represented his country at under-19, under-20 and under-21 level. In 2010, he was part of the team that won the 2010 UEFA European Under-19 Football Championship on home soil. He made his debut for the senior national team in 2014 and played at that year's World Cup, helping France to the quarter-finals. Griezmann was the top scorer and Player of the Tournament at UEFA Euro 2016, where the French were runners-up on home soil, after a 1-0 defeat to Portugal.\nFor his performances during the course of 2016, he was shortlisted for the Ballon d'Or 2016 award in which he finished at the third place."}
{"title": "The Last of Us","extract": "The Last of Us is an action-adventure survival horror video game developed by Naughty Dog and published by Sony Computer Entertainment. It was released for the PlayStation 3 in June 2013. Players control Joel, a smuggler tasked with escorting a teenage girl named Ellie across a post-apocalyptic United States. The Last of Us is played from a third-person perspective; players use firearms and improvised weapons, and can use stealth to defend against hostile humans and cannibalistic creatures infected by a mutated strain of the Cordyceps fungus. In the game's online multiplayer mode, up to eight players engage in co-operative and competitive gameplay.\nDevelopment of The Last of Us began in 2009, soon after the release of Naughty Dog's previous game, Uncharted 2: Among Thieves. The relationship between Joel and Ellie is the focus, with all other elements developed around it. Actors Troy Baker and Ashley Johnson portrayed Joel and Ellie respectively through voice and motion capture. Both assisted creative director Neil Druckmann with the development of the characters and story. The original score was composed and performed by Gustavo Santaolalla.\nFollowing its announcement in December 2011, The Last of Us was widely anticipated. It was acclaimed for its characterization, subtext, exploration of the human condition, and depiction of female characters. The Last of Us became one of the best-selling PlayStation 3 games, selling over 1.3 million units in its first week and over eight million units within fourteen months. Considered to be one of the greatest video games of all time, it won year-end accolades, including multiple Game of the Year awards from several gaming publications, critics, and game award shows, making it one of the most awarded games in history.\nAfter the game's release, Naughty Dog released several downloadable content additions; The Last of Us: Left Behind adds a new single-player campaign following Ellie and her best friend Riley. An enhanced edition of the original game, The Last of Us Remastered, was released for the PlayStation 4 in July 2014. A sequel, The Last of Us Part II, was announced in December 2016."}
{"title": "Apache Spark","extract": "Apache Spark is an open-source cluster-computing framework. Originally developed at the University of California, Berkeley's AMPLab, the Spark codebase was later donated to the Apache Software Foundation, which has maintained it since. Spark provides an interface for programming entire clusters with implicit data parallelism and fault-tolerance.\n\n"},
{"title": "Gears of War","extract": "Gears of War is a video game franchise created and originally owned by Epic Games, developed and managed by The Coalition, and owned and published by Microsoft Studios. The series focuses on the conflict between humanity, the subterranean reptilian hominids known as the Locust Horde, and their mutated counterparts, the Lambent & the Swarm. The franchise consists of five third-person shooter video games, which has also been supplemented by a comic book series and five novels.\nThe first installment, titled Gears of War, was released on November 7, 2006 for the Xbox 360. The game follows protagonist Marcus Fenix, a soldier in the Coalition of Ordered Governments tasked to lead a last-ditch effort to destroy the Locust Horde and save humanity. Two subsequent titles, Gears of War 2 (2008) and Gears of War 3 (2011), continued Fenix and humanity’s ongoing conflict with the Locust Horde and Lambent forces. In 2013, Epic Games and Microsoft released Gears of War: Judgment, a prequel to the series’ first title, which instead focuses on Damon Baird, one of Fenix's squad-mates. Gears of War: Ultimate Edition was released for Microsoft Windows on March 1, 2016. The series' third sequel, Gears of War 4, is set 25 years after Gears of War 3 and follows Marcus Fenix's son, JD, as he battles new foes that threaten humanity.\nGears of War was developed by Epic Games. Cliff Bleszinski, who has previously worked on Epic’s Unreal Tournament games, served the series’ lead game designer for the first three installments. He was inspired by gameplay elements from Resident Evil 4, Kill Switch, and Bionic Commando. The series was also guided by Rod Fergusson, the executive producer and director of development of Epic Games until 2012. The first four installments of the Gears of War series used a modified version of the Unreal Engine 3 engine. On January 27, 2014, Microsoft acquired all rights to the franchise from Epic Games. Canadian studio The Coalition developed Gears of War 4, which was released on October 11, 2016 for the Xbox One and Windows 10.\nGears of War became one of the best-selling franchises for the Xbox 360. The series is well known for its emphasis on cover-based combat, in which players can use objects to avoid gunfire or safely engage enemies. All five installments in Gears of War featured several multiplayer modes that allowed players to compete against each other or team-up to battle AI opponents on Xbox Live. The Gears of War games have been amongst the most popular and most played titles on Xbox Live."}
{"title": "Apache Flink","extract": "Apache Flink is a community-driven open source framework for distributed big data analytics, like Hadoop and Spark. The core of Apache Flink is a distributed streaming dataflow engine written in Java and Scala. It aims to bridge the gap between MapReduce-like systems and shared-nothing parallel database systems. Therefore, Flink executes arbitrary dataflow programs in a data-parallel and pipelined manner. Flink's pipelined runtime system enables the execution of bulk/batch and stream processing programs. Furthermore, Flink's runtime supports the execution of iterative algorithms natively.\nFlink programs can be written in Java or Scala and are automatically compiled and optimized into dataflow programs that are executed in a cluster or cloud environment. Flink does not provide its own data storage system, input data must be stored in a distributed storage system like HDFS or HBase. For data stream processing, Flink consumes data from (reliable) message queues like Kafka.\n\n"}
{"title": "Resident Evil","extract": "Resident Evil, known as Biohazard (バイオハザード, Baiohazādo) in Japan, is a survival horror video game based media franchise created by Shinji Mikami and Tokuro Fujiwara and owned by the video game company Capcom. The franchise focuses around a series of survival horror video games, but has since branched out into comic books, novels, and novelizations, sound dramas, live-action films, animated sequels to the games, and a variety of associated merchandise, such as action figures. The series' overarching plot focuses on multiple characters, and their roles in recurring outbreaks of zombies and other monsters, initially due to the release of the T-virus, but still more biological weapons over time, created mainly by the fictional Umbrella Corporation and various other organizations in later games.\nThe eponymous first game in the series was released in 1996 as a survival horror video game, but the franchise has since grown to encompass other video game genres. The series is a mix of action and horror film-inspired plotlines, exploration, and puzzle solving, but from Resident Evil 4 onwards, the main series takes a more third-person shooter approach, with fewer puzzles and greater emphasis on gunplay and weapons upgrading. As of 2015, the video game series has sold 61 million units worldwide, and has become Capcom's biggest franchise in terms of sales."}
{"title": "Zinedine Zidane","extract": "Zinedine Yazid Zidane (French pronunciation: [zinedin zidan], born 23 June 1972), nicknamed \"Zizou\", is a retired French footballer and current manager of Real Madrid. He played as an attacking midfielder for the France national team, Cannes, Bordeaux, Juventus and Real Madrid. Renowned for his elegance, vision, ball control and technique, Zidane was named the best European footballer of the past 50 years in the UEFA Golden Jubilee Poll. He is widely regarded as one of the greatest players in the history of the game.\nAt club level, Zidane won the La Liga title and the UEFA Champions League with Real Madrid, two Serie A league championships with Juventus and an Intercontinental Cup and a UEFA Super Cup each with both aforementioned teams. His 2001 transfer from Juventus to Real Madrid set a world record fee of an equivalent €75 million. His left-foot volleyed winner in the 2002 UEFA Champions League Final is considered to be one of the greatest goals in the competition's history. On the international stage with France, Zidane won the 1998 FIFA World Cup, scoring twice in the final, and UEFA Euro 2000 where he was named Player of the Tournament. The World Cup triumph made him a national hero in France, and he received the Légion d'honneur in 1998.\nZidane was named the FIFA World Player of the Year three times, in 1998, 2000 and 2003, and won the 1998 Ballon d'Or. He was Ligue 1 Player of the Year in 1996, Serie A Footballer of the Year in 2001 and La Liga Best Foreign Player in 2002. Zidane received the Golden Ball for player of the tournament at the 2006 World Cup, despite his infamous sending off in the final against Italy for headbutting Marco Materazzi in the chest. Prior to the World Cup, he announced he would retire at the end of the tournament.\nAfter retirement, Zidane became assistant coach at Real Madrid under Carlo Ancelotti for the 2013–14 season. After a successful year in which the club won the UEFA Champions League and Copa del Rey, Zidane became the coach of Real Madrid's B team, Real Madrid Castilla. In 2010, Zidane was an ambassador for Qatar's successful bid to stage the 2022 FIFA World Cup, the first Arab country to host the tournament. Zidane is currently the manager of Real Madrid, taking over the position in January 2016. In his first season as manager, Zidane won the UEFA Champions League title."}
{"title": "Hugo Sánchez","extract": "Hugo Sánchez Márquez (born 11 July 1958) is a retired Mexican professional footballer and manager. A prolific goalscorer known for his spectacular strikes and volleys, Sánchez is widely regarded as Mexico's greatest-ever footballer, and one of the greatest players of his generation. In 1999, the International Federation of Football History and Statistics voted Sánchez the 26th best footballer of the 20th century, and the best footballer from the CONCACAF region. In 2004 Sánchez was named in the FIFA 100 list of the world's greatest living players. He is the fourth highest scorer in the history of Spain's top division, and is the sixth highest goalscorer in Real Madrid's history.\nSánchez began his career playing for Club Universidad Nacional in 1976, and briefly went on loan to the San Diego Sockers of the North American Soccer League in 1979. In 1981, he moved to Spain to play for Atlético Madrid, playing for the Colchoneros for four years before moving to cross-town rivals Real Madrid, where he would spend the best years of his career, winning numerous titles and accolades.\nFrom 1977 to 1994, Sánchez was a member of the Mexico national team, gaining 58 caps and scoring 29 goals. He participated in three FIFA World Cup tournaments and was a part of the Mexico team that reached the quarter-finals of the 1986 World Cup.\nAs a manager, he won two-consecutive league championships with UNAM. After managing Necaxa, he was announced as coach of the Mexico national football team in 2006, but was fired in March 2008 due to poor results. In 2009, Sánchez was named manager of UD Almería, and helped to save the club from relegation.\nAs of January 2015, Sánchez is a commentator for ESPN in Mexico and the United States. He had been a guest analyst for ESPN during their coverage of the 2014 FIFA World Cup."}
{"title": "Need for Speed","extract": "Need for Speed, also known by its initials NFS, is a racing video game franchise published by Electronic Arts and developed by several studios including EA Black Box, Criterion Games and Ghost Games.\nThe series released its first title, The Need for Speed in 1994. The title comes from a famous quote from the 1986 film Top Gun. All installments of the series consist of racing cars on various tracks, with several titles including police pursuits in races. Since Need for Speed: High Stakes, the series has also integrated car body customization into gameplay.\nNeed for Speed is the most successful racing video game series in the world, and one of the most successful video game franchises of all time. Over 150 million copies of games in the series have been sold to date.\nIn June 2012, following Black Box's restructuring, British developer Criterion Games announced that it was in full control of the Need for Speed franchise. However, in August 2013, Swedish and British developers Ghost Games, Ghost Games UK and Criterion Games joined forces for the foreseeable future of the Need for Speed series. At the time, Ghost Games UK staff consisted of 80% of former Criterion Games employees."}
{"title": "Scala (programming language)","extract": "Scala (/ˈskɑːlɑː/ SKAH-lah) is a general-purpose programming language. Scala has full support for functional programming and a strong static type system. Designed to be concise, many of Scala's design decisions were inspired by criticism of Java's shortcomings.\nScala source code is intended to be compiled to Java bytecode, so that the resulting executable code runs on a Java virtual machine. Java libraries may be used directly in Scala code and vice versa (language interoperability). Like Java, Scala is object-oriented, and uses a curly-brace syntax reminiscent of the C programming language. Unlike Java, Scala has many features of functional programming languages like Scheme, Standard ML and Haskell, including currying, type inference, immutability, lazy evaluation, and pattern matching. It also has an advanced type system supporting algebraic data types, covariance and contravariance, higher-order types (but not higher-rank types), and anonymous types. Other features of Scala not present in Java include operator overloading, optional parameters, named parameters, raw strings, and no checked exceptions.\nThe name Scala is a portmanteau of scalable and language, signifying that it is designed to grow with the demands of its users."}
{"title": "Super Mario","extract": "Super Mario (Japanese: スーパーマリオ, Hepburn: Sūpā Mario) is a series of platform video games created by Nintendo featuring their mascot, Mario. Alternatively called the Super Mario Bros. (スーパーマリオブラザーズ, Sūpā Mario Burazāzu) series or simply the Mario (マリオ) series, it is the central series of the greater Mario franchise. At least one Super Mario game has been released for every major Nintendo video game console and handheld.\nThe Super Mario games follow Mario's adventures in the fictional Mushroom Kingdom, usually with Mario as the player character. He is usually joined by his brother, Luigi, and occasionally by other members of the Mario cast. As in platform video games, the player runs and jumps across platforms and atop enemies in themed levels. The games have simple plots, typically with Mario rescuing the kidnapped Princess Peach from the primary antagonist, Bowser. The first title in the series, Super Mario Bros., released for the Nintendo Entertainment System (NES) in 1985, established gameplay concepts and elements prevalent in nearly every Super Mario game since. These include a multitude of power-ups and items that give Mario special magic powers such as fireball-throwing and size-changing into giant and miniature sizes.\nThe Super Mario series is part of the greater Mario franchise. This includes other video game genres as well as media such as film, television, printed media and merchandise. Over 310 million copies of games in the Super Mario series have been sold worldwide, as of September 2015, making it the best-selling video game series in history."}
{"title": "Javier Hernández","extract": "Javier Hernández Balcázar (Spanish  [xaˈβjeɾ erˈnandes] ; born 1 June 1988) is a Mexican professional footballer who plays as a forward for German club Bayer Leverkusen and the Mexico national team. Hernández is commonly known by his nickname, Chicharito (Mexican Spanish: little pea), which he wears on his shirt.\nHe began his career in 2006, playing for the Mexican club Guadalajara, before becoming the first Mexican player to join Manchester United in July 2010. After falling out of favour under managers David Moyes and Louis van Gaal, he spent the 2014–15 season on loan to Real Madrid, then moved permanently to Bundesliga club Bayer Leverkusen in August 2015. His minutes-per-goal ratio during his time with Manchester United is among the most prolific in the history of the Premier League.\nHernández made his debut for Mexico in September 2009 in a match against Colombia. He has represented Mexico at the 2010 FIFA World Cup, the 2011 CONCACAF Gold Cup, the 2013 FIFA Confederations Cup, and the 2014 FIFA World Cup. He was the Gold Cup's top scorer with seven goals and was named the most valuable player of the tournament. He is the second highest goalscorer of all-time for the Mexico national team."}
{"title": "Apache ZooKeeper","extract": "Apache ZooKeeper is a software project of the Apache Software Foundation. It is essentially a distributed hierarchical key-value store, which is used to provide a distributed configuration service, synchronization service, and naming registry for large distributed systems. ZooKeeper was a sub-project of Hadoop but is now a top-level project in its own right.\nZooKeeper's architecture supports high availability through redundant services. The clients can thus ask another ZooKeeper leader if the first fails to answer. ZooKeeper nodes store their data in a hierarchical name space, much like a file system or a tree data structure. Clients can read from and write to the nodes and in this way have a shared configuration service. Updates are totally ordered.\nZooKeeper is used by companies including Rackspace, Yahoo!, Odnoklassniki, Reddit and eBay as well as open source enterprise search systems like Solr.\n\n"}
{"title": "Big data","extract": "Big data is a term for data sets that are so large or complex that traditional data processing applications are inadequate to deal with them. Challenges include analysis, capture, data curation, search, sharing, storage, transfer, visualization, querying, updating and information privacy. The term \"big data\" often refers simply to the use of predictive analytics, user behavior analytics, or certain other advanced data analytics methods that extract value from data, and seldom to a particular size of data set. \"There is little doubt that the quantities of data now available are indeed large, but that’s not the most relevant characteristic of this new data ecosystem.\"\nAnalysis of data sets can find new correlations to \"spot business trends, prevent diseases, combat crime and so on\". Scientists, business executives, practitioners of medicine, advertising and governments alike regularly meet difficulties with large data-sets in areas including Internet search, finance, urban informatics, and business informatics. Scientists encounter limitations in e-Science work, including meteorology, genomics, connectomics, complex physics simulations, biology and environmental research.\nData sets grow rapidly - in part because they are increasingly gathered by cheap and numerous information-sensing mobile devices, aerial (remote sensing), software logs, cameras, microphones, radio-frequency identification (RFID) readers and wireless sensor networks. The world's technological per-capita capacity to store information has roughly doubled every 40 months since the 1980s; as of 2012, every day 2.5 exabytes (2.5×1018) of data is generated. One question for large enterprises is determining who should own big-data initiatives that affect the entire organization.\nRelational database management systems and desktop statistics- and visualization-packages often have difficulty handling big data. The work may require \"massively parallel software running on tens, hundreds, or even thousands of servers\". What counts as \"big data\" varies depending on the capabilities of the users and their tools, and expanding capabilities make big data a moving target. \"For some organizations, facing hundreds of gigabytes of data for the first time may trigger a need to reconsider data management options. For others, it may take tens or hundreds of terabytes before data size becomes a significant consideration.\""}
{"title": "Data science","extract": "Data science, also known as data-driven science, is an interdisciplinary field about scientific processes and systems to extract knowledge or insights from data in various forms, either structured or unstructured, which is a continuation of some of the data analysis fields such as statistics, machine learning, data mining, and predictive analytics, similar to Knowledge Discovery in Databases (KDD).\nTuring award winner Jim Gray imagined data science as a \"fourth paradigm\" of science (empirical, theoretical, computational and now data-driven) and asserted that \"everything about science is changing because of the impact of information technology\" and the data deluge."}